wosayttn/EC_M55M1_Drive_RGB_LCD_Panel_using_EBI/SampleCode/ExampleCode/Driving_Sync_Signal_LCD_Panel_via_EBI/gdma/dma350_regdef.h
 - 1101: Normal memory, Inner Write allocate, Inner Write-back non-transient
 - 1110: Normal memory, Inner Read allocate, Inner Write-back non-transient
 - 1111: Normal memory, Inner Read/Write allocate, Inner Write-back non-transient*/
#define DMA_CH_DESTRANSCFG_DESMEMATTRLO_0           (0x1UL << DMA_CH_DESTRANSCFG_DESMEMATTRLO_Pos)            /*!< 0x00000001UL*/
#define DMA_CH_DESTRANSCFG_DESMEMATTRLO_1           (0x2UL << DMA_CH_DESTRANSCFG_DESMEMATTRLO_Pos)            /*!< 0x00000002UL*/
#define DMA_CH_DESTRANSCFG_DESMEMATTRLO_2           (0x4UL << DMA_CH_DESTRANSCFG_DESMEMATTRLO_Pos)            /*!< 0x00000004UL*/
#define DMA_CH_DESTRANSCFG_DESMEMATTRLO_3           (0x8UL << DMA_CH_DESTRANSCFG_DESMEMATTRLO_Pos)            /*!< 0x00000008UL*/
#define DMA_CH_DESTRANSCFG_DESMEMATTRHI_Pos         (4U)
#define DMA_CH_DESTRANSCFG_DESMEMATTRHI_Msk         (0xFUL << DMA_CH_DESTRANSCFG_DESMEMATTRHI_Pos)            /*!< 0x000000F0UL*/
#define DMA_CH_DESTRANSCFG_DESMEMATTRHI             DMA_CH_DESTRANSCFG_DESMEMATTRHI_Msk                       /*!< DESMEMATTRHI[ 3:0] bits Destination Transfer Memory Attribute field [7:4].
 - 0000: Device memory
 - 0001: Normal memory, Outer Write allocate, Outer Write-through transient
 - 0010: Normal memory, Outer Read allocate, Outer Write-through transient
 - 0011: Normal memory, Outer Read/Write allocate, Outer Write-through transient
 - 0100: Normal memory, Outer non-cacheable
 - 0101: Normal memory, Outer Write allocate, Outer Write-back transient
 - 0110: Normal memory, Outer Read allocate, Outer Write-back transient
 - 0111: Normal memory, Outer Read/Write allocate, Outer Write-back transient
 - 1000: Normal memory, Outer Write-through non-transient
 - 1001: Normal memory, Outer Write allocate, Outer Write-through non-transient
 - 1010: Normal memory, Outer Read allocate, Outer Write-through non-transient
 - 1011: Normal memory, Outer Read/Write allocate, Outer Write-through non-transient
 - 1100: Normal memory, Outer Write-back non-transient
 - 1101: Normal memory, Outer Write allocate, Outer Write-back non-transient
 - 1110: Normal memory, Outer Read allocate, Outer Write-back non-transient
 - 1111: Normal memory, Outer Read/Write allocate, Outer Write-back non-transient*/
#define DMA_CH_DESTRANSCFG_DESMEMATTRHI_0           (0x1UL << DMA_CH_DESTRANSCFG_DESMEMATTRHI_Pos)            /*!< 0x00000010UL*/
#define DMA_CH_DESTRANSCFG_DESMEMATTRHI_1           (0x2UL << DMA_CH_DESTRANSCFG_DESMEMATTRHI_Pos)            /*!< 0x00000020UL*/
#define DMA_CH_DESTRANSCFG_DESMEMATTRHI_2           (0x4UL << DMA_CH_DESTRANSCFG_DESMEMATTRHI_Pos)            /*!< 0x00000040UL*/
#define DMA_CH_DESTRANSCFG_DESMEMATTRHI_3           (0x8UL << DMA_CH_DESTRANSCFG_DESMEMATTRHI_Pos)            /*!< 0x00000080UL*/
#define DMA_CH_DESTRANSCFG_DESSHAREATTR_Pos         (8U)
#define DMA_CH_DESTRANSCFG_DESSHAREATTR_Msk         (0x3UL << DMA_CH_DESTRANSCFG_DESSHAREATTR_Pos)            /*!< 0x00000300UL*/
#define DMA_CH_DESTRANSCFG_DESSHAREATTR             DMA_CH_DESTRANSCFG_DESSHAREATTR_Msk                       /*!< DESSHAREATTR[ 1:0] bits Destination Transfer Shareability Attribute.
 - 00: Non-shareable
 - 01: Reserved
 - 10: Outer shareable
 - 11: Inner shareable*/
#define DMA_CH_DESTRANSCFG_DESSHAREATTR_0           (0x1UL << DMA_CH_DESTRANSCFG_DESSHAREATTR_Pos)            /*!< 0x00000100UL*/
#define DMA_CH_DESTRANSCFG_DESSHAREATTR_1           (0x2UL << DMA_CH_DESTRANSCFG_DESSHAREATTR_Pos)            /*!< 0x00000200UL*/
#define DMA_CH_DESTRANSCFG_DESNONSECATTR_Pos        (10U)
#define DMA_CH_DESTRANSCFG_DESNONSECATTR_Msk        (0x1UL << DMA_CH_DESTRANSCFG_DESNONSECATTR_Pos)           /*!< 0x00000400UL*/
#define DMA_CH_DESTRANSCFG_DESNONSECATTR            DMA_CH_DESTRANSCFG_DESNONSECATTR_Msk                      /*!< DESNONSECATTR bit Destination Transfer Non-secure Attribute.
 - 0: Secure
 - 1: Non-secure
 When a channel is Non-secure this bit is tied to 1. */
#define DMA_CH_DESTRANSCFG_DESPRIVATTR_Pos          (11U)
#define DMA_CH_DESTRANSCFG_DESPRIVATTR_Msk          (0x1UL << DMA_CH_DESTRANSCFG_DESPRIVATTR_Pos)             /*!< 0x00000800UL*/
#define DMA_CH_DESTRANSCFG_DESPRIVATTR              DMA_CH_DESTRANSCFG_DESPRIVATTR_Msk                        /*!< DESPRIVATTR bit Destination Transfer Privilege Attribute.
 - 0: Unprivileged
 - 1: Privileged
 When a channel is unprivileged this bit is tied to 0.*/
#define DMA_CH_DESTRANSCFG_DESMAXBURSTLEN_Pos       (16U)
#define DMA_CH_DESTRANSCFG_DESMAXBURSTLEN_Msk       (0xFUL << DMA_CH_DESTRANSCFG_DESMAXBURSTLEN_Pos)          /*!< 0x000F0000UL*/
#define DMA_CH_DESTRANSCFG_DESMAXBURSTLEN           DMA_CH_DESTRANSCFG_DESMAXBURSTLEN_Msk                     /*!< DESMAXBURSTLEN[ 3:0] bits Destination Max Burst Length. Hint for the DMA on what is the maximum allowed burst size it can use for write transfers. The maximum number of beats sent by the DMA for a write burst is equal to DESMAXBURSTLEN + 1. Default value is 16 beats, which allows the DMA to set all burst sizes. Note: Limited by the DATA_BUFF_SIZE so larger settings may not always result in larger bursts.*/
#define DMA_CH_DESTRANSCFG_DESMAXBURSTLEN_0         (0x1UL << DMA_CH_DESTRANSCFG_DESMAXBURSTLEN_Pos)          /*!< 0x00010000UL*/
#define DMA_CH_DESTRANSCFG_DESMAXBURSTLEN_1         (0x2UL << DMA_CH_DESTRANSCFG_DESMAXBURSTLEN_Pos)          /*!< 0x00020000UL*/
#define DMA_CH_DESTRANSCFG_DESMAXBURSTLEN_2         (0x4UL << DMA_CH_DESTRANSCFG_DESMAXBURSTLEN_Pos)          /*!< 0x00040000UL*/
#define DMA_CH_DESTRANSCFG_DESMAXBURSTLEN_3         (0x8UL << DMA_CH_DESTRANSCFG_DESMAXBURSTLEN_Pos)          /*!< 0x00080000UL*/
/****************  Field definitions for CH_XADDRINC register  ****************/
#define DMA_CH_XADDRINC_SRCXADDRINC_Pos             (0U)
#define DMA_CH_XADDRINC_SRCXADDRINC_Msk             (0xFFFFUL << DMA_CH_XADDRINC_SRCXADDRINC_Pos)             /*!< 0x0000FFFFUL*/
#define DMA_CH_XADDRINC_SRCXADDRINC                 DMA_CH_XADDRINC_SRCXADDRINC_Msk                           /*!< SRCXADDRINC[15:0] bits Source X dimension Address Increment. This value is used as the increment between each TRANSIZE transfer. When a single bit is used then only 0 and 1 can be set. For wider increment registers, two's complement used with a range between -32768 to 32767 when the counter is 16-bits wide. The width of the register is indicated by the INC_WIDTH parameter. SRCADDR_next = SRCADDR + 2^TRANSIZE * SRCXADDRINC*/
#define DMA_CH_XADDRINC_DESXADDRINC_Pos             (16U)
#define DMA_CH_XADDRINC_DESXADDRINC_Msk             (0xFFFFUL << DMA_CH_XADDRINC_DESXADDRINC_Pos)             /*!< 0xFFFF0000UL*/
#define DMA_CH_XADDRINC_DESXADDRINC                 DMA_CH_XADDRINC_DESXADDRINC_Msk                           /*!< DESXADDRINC[15:0] bits Destination X dimension Address Increment. This value is used as the increment between each TRANSIZE transfer. When a single bit is used then only 0 and 1 can be set. For wider increment registers, two's complement used with a range between -32768 to 32767 when the counter is 16-bits wide. The width of the register is indicated by the INC_WIDTH parameter. DESADDR_next = DESADDR + 2^TRANSIZE * DESXADDRINC*/
/**************  Field definitions for CH_YADDRSTRIDE register  ***************/
#define DMA_CH_YADDRSTRIDE_SRCYADDRSTRIDE_Pos       (0U)
#define DMA_CH_YADDRSTRIDE_SRCYADDRSTRIDE_Msk       (0xFFFFUL << DMA_CH_YADDRSTRIDE_SRCYADDRSTRIDE_Pos)       /*!< 0x0000FFFFUL*/
#define DMA_CH_YADDRSTRIDE_SRCYADDRSTRIDE           DMA_CH_YADDRSTRIDE_SRCYADDRSTRIDE_Msk                     /*!< SRCYADDRSTRIDE[15:0] bits Source Address Stride between lines. Calculated in TRANSIZE aligned steps. This value is used to increment the SRCADDR after completing the transfer of a source line. SRCADDR_next_line_base = SRCADDR_line_base + 2^TRANSIZE * SRCYADDRSTRIDE. Two's complement used with a range between -32768 to 32767. When set to 0 the SRCADDR is not incremented after completing one line. Not present when HAS_2D is 0.*/
#define DMA_CH_YADDRSTRIDE_DESYADDRSTRIDE_Pos       (16U)
#define DMA_CH_YADDRSTRIDE_DESYADDRSTRIDE_Msk       (0xFFFFUL << DMA_CH_YADDRSTRIDE_DESYADDRSTRIDE_Pos)       /*!< 0xFFFF0000UL*/
#define DMA_CH_YADDRSTRIDE_DESYADDRSTRIDE           DMA_CH_YADDRSTRIDE_DESYADDRSTRIDE_Msk                     /*!< DESYADDRSTRIDE[15:0] bits Destination Address Stride between lines. Calculated in TRANSIZE aligned steps. This value is used to increment the DESADDR after completing the transfer of a destination line. DESADDR_next_line_base = DESADDR_line_base + 2^TRANSIZE * DESYADDRSTRIDE. Two's complement used with a range between -32768 to 32767. When set to 0 the DESADDR is not incremented after completing one line. Not present when HAS_2D is 0.*/
/****************  Field definitions for CH_FILLVAL register  *****************/
#define DMA_CH_FILLVAL_FILLVAL_Pos                  (0U)
#define DMA_CH_FILLVAL_FILLVAL_Msk                  (0xFFFFFFFFUL << DMA_CH_FILLVAL_FILLVAL_Pos)              /*!< 0xFFFFFFFFUL*/
#define DMA_CH_FILLVAL_FILLVAL                      DMA_CH_FILLVAL_FILLVAL_Msk                                /*!< FILLVAL[31:0] bits Fill pattern value. When XTYPE or YTYPE is set to fill mode, then this register value is used on the write data bus when the command starts to fill the memory area. The TRANSIZE defines the width of the FILLVAL used for the command. For byte transfers the FILLVAL[7:0] is used, other bits are ignored. For halfword transfers the FILLVAL[15:0] is used, other bits are ignored. For 64-bit and wider transfers the FILLVAL[31:0] pattern is repeated on the full width of the data bus. Not present when HAS_WRAP is 0.*/
/*****************  Field definitions for CH_YSIZE register  ******************/
#define DMA_CH_YSIZE_SRCYSIZE_Pos                   (0U)
#define DMA_CH_YSIZE_SRCYSIZE_Msk                   (0xFFFFUL << DMA_CH_YSIZE_SRCYSIZE_Pos)                   /*!< 0x0000FFFFUL*/
#define DMA_CH_YSIZE_SRCYSIZE                       DMA_CH_YSIZE_SRCYSIZE_Msk                                 /*!< SRCYSIZE[15:0] bits Source Y dimension or number of lines. Not present when HAS_2D is 0.*/
#define DMA_CH_YSIZE_DESYSIZE_Pos                   (16U)
#define DMA_CH_YSIZE_DESYSIZE_Msk                   (0xFFFFUL << DMA_CH_YSIZE_DESYSIZE_Pos)                   /*!< 0xFFFF0000UL*/
#define DMA_CH_YSIZE_DESYSIZE                       DMA_CH_YSIZE_DESYSIZE_Msk                                 /*!< DESYSIZE[15:0] bits Destination Y dimension or number of lines. Not present when HAS_2D is 0. HAS_WRAP or HAS_STREAM configuration needs to be set to allow writes to this register, otherwise it is read-only.*/
/****************  Field definitions for CH_TMPLTCFG register  ****************/
#define DMA_CH_TMPLTCFG_SRCTMPLTSIZE_Pos            (8U)
#define DMA_CH_TMPLTCFG_SRCTMPLTSIZE_Msk            (0x1FUL << DMA_CH_TMPLTCFG_SRCTMPLTSIZE_Pos)              /*!< 0x00001F00UL*/
#define DMA_CH_TMPLTCFG_SRCTMPLTSIZE                DMA_CH_TMPLTCFG_SRCTMPLTSIZE_Msk                          /*!< SRCTMPLTSIZE[ 4:0] bits Source Template Size in number of transfers plus one.
 - 0: Source template is disabled.
 - 1 to 31: Bits SRCTMPLT[SRCTMPLTSIZE:0] is used as the source template. Not present when HAS_TMPLT is 0.*/
#define DMA_CH_TMPLTCFG_SRCTMPLTSIZE_0              (0x1UL << DMA_CH_TMPLTCFG_SRCTMPLTSIZE_Pos)               /*!< 0x00000100UL*/
#define DMA_CH_TMPLTCFG_SRCTMPLTSIZE_1              (0x2UL << DMA_CH_TMPLTCFG_SRCTMPLTSIZE_Pos)               /*!< 0x00000200UL*/
#define DMA_CH_TMPLTCFG_SRCTMPLTSIZE_2              (0x4UL << DMA_CH_TMPLTCFG_SRCTMPLTSIZE_Pos)               /*!< 0x00000400UL*/
#define DMA_CH_TMPLTCFG_SRCTMPLTSIZE_3              (0x8UL << DMA_CH_TMPLTCFG_SRCTMPLTSIZE_Pos)               /*!< 0x00000800UL*/
#define DMA_CH_TMPLTCFG_SRCTMPLTSIZE_4              (0x10UL << DMA_CH_TMPLTCFG_SRCTMPLTSIZE_Pos)              /*!< 0x00001000UL*/
#define DMA_CH_TMPLTCFG_DESTMPLTSIZE_Pos            (16U)
#define DMA_CH_TMPLTCFG_DESTMPLTSIZE_Msk            (0x1FUL << DMA_CH_TMPLTCFG_DESTMPLTSIZE_Pos)              /*!< 0x001F0000UL*/
#define DMA_CH_TMPLTCFG_DESTMPLTSIZE                DMA_CH_TMPLTCFG_DESTMPLTSIZE_Msk                          /*!< DESTMPLTSIZE[ 4:0] bits Destination Template Size in number of transfers plus one.
 - 0: Destination template is disabled.
 - 1 to 31: DESTMPLT[DESTMPLTSIZE:0] is used as the destination template. Not present when HAS_TMPLT is 0.*/
#define DMA_CH_TMPLTCFG_DESTMPLTSIZE_0              (0x1UL << DMA_CH_TMPLTCFG_DESTMPLTSIZE_Pos)               /*!< 0x00010000UL*/
#define DMA_CH_TMPLTCFG_DESTMPLTSIZE_1              (0x2UL << DMA_CH_TMPLTCFG_DESTMPLTSIZE_Pos)               /*!< 0x00020000UL*/
#define DMA_CH_TMPLTCFG_DESTMPLTSIZE_2              (0x4UL << DMA_CH_TMPLTCFG_DESTMPLTSIZE_Pos)               /*!< 0x00040000UL*/
#define DMA_CH_TMPLTCFG_DESTMPLTSIZE_3              (0x8UL << DMA_CH_TMPLTCFG_DESTMPLTSIZE_Pos)               /*!< 0x00080000UL*/
#define DMA_CH_TMPLTCFG_DESTMPLTSIZE_4              (0x10UL << DMA_CH_TMPLTCFG_DESTMPLTSIZE_Pos)              /*!< 0x00100000UL*/
/****************  Field definitions for CH_SRCTMPLT register  ****************/
#define DMA_CH_SRCTMPLT_SRCTMPLTLSB_Pos             (0U)
#define DMA_CH_SRCTMPLT_SRCTMPLTLSB_Msk             (0x1UL << DMA_CH_SRCTMPLT_SRCTMPLTLSB_Pos)                /*!< 0x00000001UL*/
#define DMA_CH_SRCTMPLT_SRCTMPLTLSB                 DMA_CH_SRCTMPLT_SRCTMPLTLSB_Msk                           /*!< SRCTMPLTLSB bit Source Packing Template Least Significant Bit. This bit of the template is read only and always set to 1 as template patterns can only start from the base address of the transfer. Not present when HAS_TMPLT is 0.*/
#define DMA_CH_SRCTMPLT_SRCTMPLT_Pos                (1U)
#define DMA_CH_SRCTMPLT_SRCTMPLT_Msk                (0x7FFFFFFFUL << DMA_CH_SRCTMPLT_SRCTMPLT_Pos)            /*!< 0xFFFFFFFEUL*/
#define DMA_CH_SRCTMPLT_SRCTMPLT                    DMA_CH_SRCTMPLT_SRCTMPLT_Msk                              /*!< SRCTMPLT[30:0] bits Source Packing Template. Bit[0] is read only and always set to 1 as template patterns can only start from the base address of the transfer. Not present when HAS_TMPLT is 0.*/
/****************  Field definitions for CH_DESTMPLT register  ****************/
#define DMA_CH_DESTMPLT_DESTMPLTLSB_Pos             (0U)
#define DMA_CH_DESTMPLT_DESTMPLTLSB_Msk             (0x1UL << DMA_CH_DESTMPLT_DESTMPLTLSB_Pos)                /*!< 0x00000001UL*/
#define DMA_CH_DESTMPLT_DESTMPLTLSB                 DMA_CH_DESTMPLT_DESTMPLTLSB_Msk                           /*!< DESTMPLTLSB bit Destination Packing Template Least Significant Bit. This bit of the template is read only and always set to 1 as template patterns can only start from the base address of the transfer. Not present when HAS_TMPLT is 0.*/
#define DMA_CH_DESTMPLT_DESTMPLT_Pos                (1U)
#define DMA_CH_DESTMPLT_DESTMPLT_Msk                (0x7FFFFFFFUL << DMA_CH_DESTMPLT_DESTMPLT_Pos)            /*!< 0xFFFFFFFEUL*/
#define DMA_CH_DESTMPLT_DESTMPLT                    DMA_CH_DESTMPLT_DESTMPLT_Msk                              /*!< DESTMPLT[30:0] bits Destination Packing Template.  Bit[0] is read only and always set to 1 as template patterns can only start from the base address of the transfer. Not present when HAS_TMPLT is 0.*/
/**************  Field definitions for CH_SRCTRIGINCFG register  **************/
#define DMA_CH_SRCTRIGINCFG_SRCTRIGINSEL_Pos        (0U)
#define DMA_CH_SRCTRIGINCFG_SRCTRIGINSEL_Msk        (0xFFUL << DMA_CH_SRCTRIGINCFG_SRCTRIGINSEL_Pos)          /*!< 0x000000FFUL*/
#define DMA_CH_SRCTRIGINCFG_SRCTRIGINSEL            DMA_CH_SRCTRIGINCFG_SRCTRIGINSEL_Msk                      /*!< SRCTRIGINSEL[ 7:0] bits Source Trigger Input Select*/
#define DMA_CH_SRCTRIGINCFG_SRCTRIGINSEL_0          (0x1UL << DMA_CH_SRCTRIGINCFG_SRCTRIGINSEL_Pos)           /*!< 0x00000001UL*/
#define DMA_CH_SRCTRIGINCFG_SRCTRIGINSEL_1          (0x2UL << DMA_CH_SRCTRIGINCFG_SRCTRIGINSEL_Pos)           /*!< 0x00000002UL*/
#define DMA_CH_SRCTRIGINCFG_SRCTRIGINSEL_2          (0x4UL << DMA_CH_SRCTRIGINCFG_SRCTRIGINSEL_Pos)           /*!< 0x00000004UL*/
#define DMA_CH_SRCTRIGINCFG_SRCTRIGINSEL_3          (0x8UL << DMA_CH_SRCTRIGINCFG_SRCTRIGINSEL_Pos)           /*!< 0x00000008UL*/
#define DMA_CH_SRCTRIGINCFG_SRCTRIGINSEL_4          (0x10UL << DMA_CH_SRCTRIGINCFG_SRCTRIGINSEL_Pos)          /*!< 0x00000010UL*/
#define DMA_CH_SRCTRIGINCFG_SRCTRIGINSEL_5          (0x20UL << DMA_CH_SRCTRIGINCFG_SRCTRIGINSEL_Pos)          /*!< 0x00000020UL*/
#define DMA_CH_SRCTRIGINCFG_SRCTRIGINSEL_6          (0x40UL << DMA_CH_SRCTRIGINCFG_SRCTRIGINSEL_Pos)          /*!< 0x00000040UL*/
#define DMA_CH_SRCTRIGINCFG_SRCTRIGINSEL_7          (0x80UL << DMA_CH_SRCTRIGINCFG_SRCTRIGINSEL_Pos)          /*!< 0x00000080UL*/
#define DMA_CH_SRCTRIGINCFG_SRCTRIGINTYPE_Pos       (8U)
#define DMA_CH_SRCTRIGINCFG_SRCTRIGINTYPE_Msk       (0x3UL << DMA_CH_SRCTRIGINCFG_SRCTRIGINTYPE_Pos)          /*!< 0x00000300UL*/
#define DMA_CH_SRCTRIGINCFG_SRCTRIGINTYPE           DMA_CH_SRCTRIGINCFG_SRCTRIGINTYPE_Msk                     /*!< SRCTRIGINTYPE[ 1:0] bits Source Trigger Input Type:
 - 00: Software only Trigger Request. SRCTRIGINSEL is ignored.
 - 01: Reserved
 - 10: HW Trigger Request. Only allowed when HAS_TRIGIN is enabled. SRCTRIGINSEL selects between external trigger inputs if HAS_TRIGSEL is enabled.
 - 11: Internal Trigger Request. Only allowed when HAS_TRIGSEL is enabled and the DMAC has multiple channels, otherwise treated as HW Trigger Request. SRCTRIGINSEL selects between DMA channels.
Note: SW triggers are also available when HW or Internal types are selected, but is is not recommended and caution must be taken when the these modes are combined.*/
#define DMA_CH_SRCTRIGINCFG_SRCTRIGINTYPE_0         (0x1UL << DMA_CH_SRCTRIGINCFG_SRCTRIGINTYPE_Pos)          /*!< 0x00000100UL*/
#define DMA_CH_SRCTRIGINCFG_SRCTRIGINTYPE_1         (0x2UL << DMA_CH_SRCTRIGINCFG_SRCTRIGINTYPE_Pos)          /*!< 0x00000200UL*/
#define DMA_CH_SRCTRIGINCFG_SRCTRIGINMODE_Pos       (10U)
#define DMA_CH_SRCTRIGINCFG_SRCTRIGINMODE_Msk       (0x3UL << DMA_CH_SRCTRIGINCFG_SRCTRIGINMODE_Pos)          /*!< 0x00000C00UL*/
#define DMA_CH_SRCTRIGINCFG_SRCTRIGINMODE           DMA_CH_SRCTRIGINCFG_SRCTRIGINMODE_Msk                     /*!< SRCTRIGINMODE[ 1:0] bits Source Trigger Input Mode:
 - 00: Command
 - 01: Reserved
 - 10: DMA driven Flow control. Only allowed when HAS_TRIGIN is enabled.
 - 11: Peripheral driven Flow control. Only allowed when HAS_TRIGIN is enabled.
Note: This field is ignored for Internal triggers as they only support Command triggers.*/
#define DMA_CH_SRCTRIGINCFG_SRCTRIGINMODE_0         (0x1UL << DMA_CH_SRCTRIGINCFG_SRCTRIGINMODE_Pos)          /*!< 0x00000400UL*/
#define DMA_CH_SRCTRIGINCFG_SRCTRIGINMODE_1         (0x2UL << DMA_CH_SRCTRIGINCFG_SRCTRIGINMODE_Pos)          /*!< 0x00000800UL*/
#define DMA_CH_SRCTRIGINCFG_SRCTRIGINBLKSIZE_Pos    (16U)
#define DMA_CH_SRCTRIGINCFG_SRCTRIGINBLKSIZE_Msk    (0xFFUL << DMA_CH_SRCTRIGINCFG_SRCTRIGINBLKSIZE_Pos)      /*!< 0x00FF0000UL*/
#define DMA_CH_SRCTRIGINCFG_SRCTRIGINBLKSIZE        DMA_CH_SRCTRIGINCFG_SRCTRIGINBLKSIZE_Msk                  /*!< SRCTRIGINBLKSIZE[ 7:0] bits Source Trigger Input Default Transfer Size. Defined transfer size per trigger + 1.*/
#define DMA_CH_SRCTRIGINCFG_SRCTRIGINBLKSIZE_0      (0x1UL << DMA_CH_SRCTRIGINCFG_SRCTRIGINBLKSIZE_Pos)       /*!< 0x00010000UL*/
#define DMA_CH_SRCTRIGINCFG_SRCTRIGINBLKSIZE_1      (0x2UL << DMA_CH_SRCTRIGINCFG_SRCTRIGINBLKSIZE_Pos)       /*!< 0x00020000UL*/
#define DMA_CH_SRCTRIGINCFG_SRCTRIGINBLKSIZE_2      (0x4UL << DMA_CH_SRCTRIGINCFG_SRCTRIGINBLKSIZE_Pos)       /*!< 0x00040000UL*/
#define DMA_CH_SRCTRIGINCFG_SRCTRIGINBLKSIZE_3      (0x8UL << DMA_CH_SRCTRIGINCFG_SRCTRIGINBLKSIZE_Pos)       /*!< 0x00080000UL*/
#define DMA_CH_SRCTRIGINCFG_SRCTRIGINBLKSIZE_4      (0x10UL << DMA_CH_SRCTRIGINCFG_SRCTRIGINBLKSIZE_Pos)      /*!< 0x00100000UL*/
#define DMA_CH_SRCTRIGINCFG_SRCTRIGINBLKSIZE_5      (0x20UL << DMA_CH_SRCTRIGINCFG_SRCTRIGINBLKSIZE_Pos)      /*!< 0x00200000UL*/
#define DMA_CH_SRCTRIGINCFG_SRCTRIGINBLKSIZE_6      (0x40UL << DMA_CH_SRCTRIGINCFG_SRCTRIGINBLKSIZE_Pos)      /*!< 0x00400000UL*/
#define DMA_CH_SRCTRIGINCFG_SRCTRIGINBLKSIZE_7      (0x80UL << DMA_CH_SRCTRIGINCFG_SRCTRIGINBLKSIZE_Pos)      /*!< 0x00800000UL*/
/**************  Field definitions for CH_DESTRIGINCFG register  **************/
#define DMA_CH_DESTRIGINCFG_DESTRIGINSEL_Pos        (0U)
#define DMA_CH_DESTRIGINCFG_DESTRIGINSEL_Msk        (0xFFUL << DMA_CH_DESTRIGINCFG_DESTRIGINSEL_Pos)          /*!< 0x000000FFUL*/
#define DMA_CH_DESTRIGINCFG_DESTRIGINSEL            DMA_CH_DESTRIGINCFG_DESTRIGINSEL_Msk                      /*!< DESTRIGINSEL[ 7:0] bits Destination Trigger Input Select*/
#define DMA_CH_DESTRIGINCFG_DESTRIGINSEL_0          (0x1UL << DMA_CH_DESTRIGINCFG_DESTRIGINSEL_Pos)           /*!< 0x00000001UL*/
#define DMA_CH_DESTRIGINCFG_DESTRIGINSEL_1          (0x2UL << DMA_CH_DESTRIGINCFG_DESTRIGINSEL_Pos)           /*!< 0x00000002UL*/
#define DMA_CH_DESTRIGINCFG_DESTRIGINSEL_2          (0x4UL << DMA_CH_DESTRIGINCFG_DESTRIGINSEL_Pos)           /*!< 0x00000004UL*/
#define DMA_CH_DESTRIGINCFG_DESTRIGINSEL_3          (0x8UL << DMA_CH_DESTRIGINCFG_DESTRIGINSEL_Pos)           /*!< 0x00000008UL*/
#define DMA_CH_DESTRIGINCFG_DESTRIGINSEL_4          (0x10UL << DMA_CH_DESTRIGINCFG_DESTRIGINSEL_Pos)          /*!< 0x00000010UL*/
#define DMA_CH_DESTRIGINCFG_DESTRIGINSEL_5          (0x20UL << DMA_CH_DESTRIGINCFG_DESTRIGINSEL_Pos)          /*!< 0x00000020UL*/
#define DMA_CH_DESTRIGINCFG_DESTRIGINSEL_6          (0x40UL << DMA_CH_DESTRIGINCFG_DESTRIGINSEL_Pos)          /*!< 0x00000040UL*/
#define DMA_CH_DESTRIGINCFG_DESTRIGINSEL_7          (0x80UL << DMA_CH_DESTRIGINCFG_DESTRIGINSEL_Pos)          /*!< 0x00000080UL*/
#define DMA_CH_DESTRIGINCFG_DESTRIGINTYPE_Pos       (8U)
#define DMA_CH_DESTRIGINCFG_DESTRIGINTYPE_Msk       (0x3UL << DMA_CH_DESTRIGINCFG_DESTRIGINTYPE_Pos)          /*!< 0x00000300UL*/
#define DMA_CH_DESTRIGINCFG_DESTRIGINTYPE           DMA_CH_DESTRIGINCFG_DESTRIGINTYPE_Msk                     /*!< DESTRIGINTYPE[ 1:0] bits Destination Trigger Input Type:
 - 00: Software only Trigger Request. DESTRIGINSEL is ignored.
 - 01: Reserved
 - 10: HW Trigger Request. Only allowed when HAS_TRIGIN is enabled. DESTRIGINSEL selects between external trigger inputs if HAS_TRIGSEL is enabled.
 - 11: Internal Trigger Request. Only allowed when HAS_TRIGSEL is enabled and the DMAC has multiple channels, otherwise treated as HW Trigger Request. DESTRIGINSEL selects between DMA channels.
Note: SW triggers are also available when HW or Internal types are selected, but is is not recommended and caution must be taken when the these modes are combined.*/
#define DMA_CH_DESTRIGINCFG_DESTRIGINTYPE_0         (0x1UL << DMA_CH_DESTRIGINCFG_DESTRIGINTYPE_Pos)          /*!< 0x00000100UL*/
#define DMA_CH_DESTRIGINCFG_DESTRIGINTYPE_1         (0x2UL << DMA_CH_DESTRIGINCFG_DESTRIGINTYPE_Pos)          /*!< 0x00000200UL*/
#define DMA_CH_DESTRIGINCFG_DESTRIGINMODE_Pos       (10U)
#define DMA_CH_DESTRIGINCFG_DESTRIGINMODE_Msk       (0x3UL << DMA_CH_DESTRIGINCFG_DESTRIGINMODE_Pos)          /*!< 0x00000C00UL*/
#define DMA_CH_DESTRIGINCFG_DESTRIGINMODE           DMA_CH_DESTRIGINCFG_DESTRIGINMODE_Msk                     /*!< DESTRIGINMODE[ 1:0] bits Destination Trigger Input Mode:
 - 00: Command
 - 01: Reserved
 - 10: DMA driven Flow control. Only allowed when HAS_TRIGIN is enabled.
 - 11: Peripheral driven Flow control. Only allowed when HAS_TRIGIN is enabled.
Note: This field is ignored for Internal triggers as they only support Command triggers.*/
#define DMA_CH_DESTRIGINCFG_DESTRIGINMODE_0         (0x1UL << DMA_CH_DESTRIGINCFG_DESTRIGINMODE_Pos)          /*!< 0x00000400UL*/
