wosayttn/EC_M55M1_Drive_RGB_LCD_Panel_using_EBI/SampleCode/ExampleCode/Driving_Sync_Signal_LCD_Panel_via_EBI/gdma/dma350_regdef.h
#define DMA_CH_DESTRIGINCFG_DESTRIGINMODE_1         (0x2UL << DMA_CH_DESTRIGINCFG_DESTRIGINMODE_Pos)          /*!< 0x00000800UL*/
#define DMA_CH_DESTRIGINCFG_DESTRIGINBLKSIZE_Pos    (16U)
#define DMA_CH_DESTRIGINCFG_DESTRIGINBLKSIZE_Msk    (0xFFUL << DMA_CH_DESTRIGINCFG_DESTRIGINBLKSIZE_Pos)      /*!< 0x00FF0000UL*/
#define DMA_CH_DESTRIGINCFG_DESTRIGINBLKSIZE        DMA_CH_DESTRIGINCFG_DESTRIGINBLKSIZE_Msk                  /*!< DESTRIGINBLKSIZE[ 7:0] bits Destination Trigger Input Default Transfer Size. Defined transfer size per trigger + 1.*/
#define DMA_CH_DESTRIGINCFG_DESTRIGINBLKSIZE_0      (0x1UL << DMA_CH_DESTRIGINCFG_DESTRIGINBLKSIZE_Pos)       /*!< 0x00010000UL*/
#define DMA_CH_DESTRIGINCFG_DESTRIGINBLKSIZE_1      (0x2UL << DMA_CH_DESTRIGINCFG_DESTRIGINBLKSIZE_Pos)       /*!< 0x00020000UL*/
#define DMA_CH_DESTRIGINCFG_DESTRIGINBLKSIZE_2      (0x4UL << DMA_CH_DESTRIGINCFG_DESTRIGINBLKSIZE_Pos)       /*!< 0x00040000UL*/
#define DMA_CH_DESTRIGINCFG_DESTRIGINBLKSIZE_3      (0x8UL << DMA_CH_DESTRIGINCFG_DESTRIGINBLKSIZE_Pos)       /*!< 0x00080000UL*/
#define DMA_CH_DESTRIGINCFG_DESTRIGINBLKSIZE_4      (0x10UL << DMA_CH_DESTRIGINCFG_DESTRIGINBLKSIZE_Pos)      /*!< 0x00100000UL*/
#define DMA_CH_DESTRIGINCFG_DESTRIGINBLKSIZE_5      (0x20UL << DMA_CH_DESTRIGINCFG_DESTRIGINBLKSIZE_Pos)      /*!< 0x00200000UL*/
#define DMA_CH_DESTRIGINCFG_DESTRIGINBLKSIZE_6      (0x40UL << DMA_CH_DESTRIGINCFG_DESTRIGINBLKSIZE_Pos)      /*!< 0x00400000UL*/
#define DMA_CH_DESTRIGINCFG_DESTRIGINBLKSIZE_7      (0x80UL << DMA_CH_DESTRIGINCFG_DESTRIGINBLKSIZE_Pos)      /*!< 0x00800000UL*/
/***************  Field definitions for CH_TRIGOUTCFG register  ***************/
#define DMA_CH_TRIGOUTCFG_TRIGOUTSEL_Pos            (0U)
#define DMA_CH_TRIGOUTCFG_TRIGOUTSEL_Msk            (0x3FUL << DMA_CH_TRIGOUTCFG_TRIGOUTSEL_Pos)              /*!< 0x0000003FUL*/
#define DMA_CH_TRIGOUTCFG_TRIGOUTSEL                DMA_CH_TRIGOUTCFG_TRIGOUTSEL_Msk                          /*!< TRIGOUTSEL[ 5:0] bits Trigger Output Select*/
#define DMA_CH_TRIGOUTCFG_TRIGOUTSEL_0              (0x1UL << DMA_CH_TRIGOUTCFG_TRIGOUTSEL_Pos)               /*!< 0x00000001UL*/
#define DMA_CH_TRIGOUTCFG_TRIGOUTSEL_1              (0x2UL << DMA_CH_TRIGOUTCFG_TRIGOUTSEL_Pos)               /*!< 0x00000002UL*/
#define DMA_CH_TRIGOUTCFG_TRIGOUTSEL_2              (0x4UL << DMA_CH_TRIGOUTCFG_TRIGOUTSEL_Pos)               /*!< 0x00000004UL*/
#define DMA_CH_TRIGOUTCFG_TRIGOUTSEL_3              (0x8UL << DMA_CH_TRIGOUTCFG_TRIGOUTSEL_Pos)               /*!< 0x00000008UL*/
#define DMA_CH_TRIGOUTCFG_TRIGOUTSEL_4              (0x10UL << DMA_CH_TRIGOUTCFG_TRIGOUTSEL_Pos)              /*!< 0x00000010UL*/
#define DMA_CH_TRIGOUTCFG_TRIGOUTSEL_5              (0x20UL << DMA_CH_TRIGOUTCFG_TRIGOUTSEL_Pos)              /*!< 0x00000020UL*/
#define DMA_CH_TRIGOUTCFG_TRIGOUTTYPE_Pos           (8U)
#define DMA_CH_TRIGOUTCFG_TRIGOUTTYPE_Msk           (0x3UL << DMA_CH_TRIGOUTCFG_TRIGOUTTYPE_Pos)              /*!< 0x00000300UL*/
#define DMA_CH_TRIGOUTCFG_TRIGOUTTYPE               DMA_CH_TRIGOUTCFG_TRIGOUTTYPE_Msk                         /*!< TRIGOUTTYPE[ 1:0] bits Trigger Output Type
 - 00: Software only Trigger Acknowledgement.
 - 01: Reserved
 - 10: HW Trigger Acknowledgement. Only allowed when HAS_TRIGOUT is enabled.
 - 11: Internal Trigger Acknowledgement. Only allowed when HAS_TRIGSEL is enabled and the DMAC has multiple channels, otherwise treated as HW Trigger Acknowledgement.*/
#define DMA_CH_TRIGOUTCFG_TRIGOUTTYPE_0             (0x1UL << DMA_CH_TRIGOUTCFG_TRIGOUTTYPE_Pos)              /*!< 0x00000100UL*/
#define DMA_CH_TRIGOUTCFG_TRIGOUTTYPE_1             (0x2UL << DMA_CH_TRIGOUTCFG_TRIGOUTTYPE_Pos)              /*!< 0x00000200UL*/
/*****************  Field definitions for CH_GPOEN0 register  *****************/
#define DMA_CH_GPOEN0_GPOEN0_Pos                    (0U)
#define DMA_CH_GPOEN0_GPOEN0_Msk                    (0xFFFFFFFFUL << DMA_CH_GPOEN0_GPOEN0_Pos)                /*!< 0xFFFFFFFFUL*/
#define DMA_CH_GPOEN0_GPOEN0                        DMA_CH_GPOEN0_GPOEN0_Msk                                  /*!< GPOEN0[31:0] bits Channel General Purpose Output (GPO) bit 0 to 31 enable mask. If bit n is '1', then GPO[n] is selected for driving by GPOVAL0[n]. If bit 'n' is '0', then GPO[n] keeps its previous value. Only [GPO_WIDTH-1:0] are implemented. All unimplemented bits are RAZWI.*/
/****************  Field definitions for CH_GPOVAL0 register  *****************/
#define DMA_CH_GPOVAL0_GPOVAL0_Pos                  (0U)
#define DMA_CH_GPOVAL0_GPOVAL0_Msk                  (0xFFFFFFFFUL << DMA_CH_GPOVAL0_GPOVAL0_Pos)              /*!< 0xFFFFFFFFUL*/
#define DMA_CH_GPOVAL0_GPOVAL0                      DMA_CH_GPOVAL0_GPOVAL0_Msk                                /*!< GPOVAL0[31:0] bits General Purpose Output Value GPO[31:0]. Write to set output value. The actual value on the GPO port will become active when the command is enabled. Read returns the register value which might be different from the actual GPO port status. Only [GPO_WIDTH-1:0] are implemented. All unimplemented bits are RAZWI.*/
/**************  Field definitions for CH_STREAMINTCFG register  **************/
#define DMA_CH_STREAMINTCFG_STREAMTYPE_Pos          (9U)
#define DMA_CH_STREAMINTCFG_STREAMTYPE_Msk          (0x3UL << DMA_CH_STREAMINTCFG_STREAMTYPE_Pos)             /*!< 0x00000600UL*/
#define DMA_CH_STREAMINTCFG_STREAMTYPE              DMA_CH_STREAMINTCFG_STREAMTYPE_Msk                        /*!< STREAMTYPE[ 1:0] bits Stream Interface operation Type
 - 00: Stream in and out used.
 - 01: Stream out only
 - 10: Stream in only
 - 11: Reserved*/
#define DMA_CH_STREAMINTCFG_STREAMTYPE_0            (0x1UL << DMA_CH_STREAMINTCFG_STREAMTYPE_Pos)             /*!< 0x00000200UL*/
#define DMA_CH_STREAMINTCFG_STREAMTYPE_1            (0x2UL << DMA_CH_STREAMINTCFG_STREAMTYPE_Pos)             /*!< 0x00000400UL*/
/****************  Field definitions for CH_LINKATTR register  ****************/
#define DMA_CH_LINKATTR_LINKMEMATTRLO_Pos           (0U)
#define DMA_CH_LINKATTR_LINKMEMATTRLO_Msk           (0xFUL << DMA_CH_LINKATTR_LINKMEMATTRLO_Pos)              /*!< 0x0000000FUL*/
#define DMA_CH_LINKATTR_LINKMEMATTRLO               DMA_CH_LINKATTR_LINKMEMATTRLO_Msk                         /*!< LINKMEMATTRLO[ 3:0] bits Link Address Read Transfer Memory Attribute field [3:0].
When LINKMEMATTRHI is Device type (0000) then this field means:
 - 0000: Device-nGnRnE
 - 0100: Device-nGnRE
 - 1000: Device-nGRE
 - 1100: Device-GRE
 - Others: Invalid resulting in UNPREDICTABLE behavior
When LINKMEMATTRHI is Normal memory type (other than 0000) then this field means:
 - 0000: Reserved
 - 0001: Normal memory, Inner Write allocate, Inner Write-through transient
 - 0010: Normal memory, Inner Read allocate, Inner Write-through transient
 - 0011: Normal memory, Inner Read/Write allocate, Inner Write-through transient
 - 0100: Normal memory, Inner non-cacheable
 - 0101: Normal memory, Inner Write allocate, Inner Write-back transient
 - 0110: Normal memory, Inner Read allocate, Inner Write-back transient
 - 0111: Normal memory, Inner Read/Write allocate, Inner Write-back transient
 - 1000: Normal memory, Inner Write-through non-transient
 - 1001: Normal memory, Inner Write allocate, Inner Write-through non-transient
 - 1010: Normal memory, Inner Read allocate, Inner Write-through non-transient
 - 1011: Normal memory, Inner Read/Write allocate, Inner Write-through non-transient
 - 1100: Normal memory, Inner Write-back non-transient
 - 1101: Normal memory, Inner Write allocate, Inner Write-back non-transient
 - 1110: Normal memory, Inner Read allocate, Inner Write-back non-transient
 - 1111: Normal memory, Inner Read/Write allocate, Inner Write-back non-transient*/
#define DMA_CH_LINKATTR_LINKMEMATTRLO_0             (0x1UL << DMA_CH_LINKATTR_LINKMEMATTRLO_Pos)              /*!< 0x00000001UL*/
#define DMA_CH_LINKATTR_LINKMEMATTRLO_1             (0x2UL << DMA_CH_LINKATTR_LINKMEMATTRLO_Pos)              /*!< 0x00000002UL*/
#define DMA_CH_LINKATTR_LINKMEMATTRLO_2             (0x4UL << DMA_CH_LINKATTR_LINKMEMATTRLO_Pos)              /*!< 0x00000004UL*/
#define DMA_CH_LINKATTR_LINKMEMATTRLO_3             (0x8UL << DMA_CH_LINKATTR_LINKMEMATTRLO_Pos)              /*!< 0x00000008UL*/
#define DMA_CH_LINKATTR_LINKMEMATTRHI_Pos           (4U)
#define DMA_CH_LINKATTR_LINKMEMATTRHI_Msk           (0xFUL << DMA_CH_LINKATTR_LINKMEMATTRHI_Pos)              /*!< 0x000000F0UL*/
#define DMA_CH_LINKATTR_LINKMEMATTRHI               DMA_CH_LINKATTR_LINKMEMATTRHI_Msk                         /*!< LINKMEMATTRHI[ 3:0] bits Link Address Read Transfer Memory Attribute field [7:4].
 - 0000: Device memory
 - 0001: Normal memory, Outer Write allocate, Outer Write-through transient
 - 0010: Normal memory, Outer Read allocate, Outer Write-through transient
 - 0011: Normal memory, Outer Read/Write allocate, Outer Write-through transient
 - 0100: Normal memory, Outer non-cacheable
 - 0101: Normal memory, Outer Write allocate, Outer Write-back transient
 - 0110: Normal memory, Outer Read allocate, Outer Write-back transient
 - 0111: Normal memory, Outer Read/Write allocate, Outer Write-back transient
 - 1000: Normal memory, Outer Write-through non-transient
 - 1001: Normal memory, Outer Write allocate, Outer Write-through non-transient
 - 1010: Normal memory, Outer Read allocate, Outer Write-through non-transient
 - 1011: Normal memory, Outer Read/Write allocate, Outer Write-through non-transient
 - 1100: Normal memory, Outer Write-back non-transient
 - 1101: Normal memory, Outer Write allocate, Outer Write-back non-transient
 - 1110: Normal memory, Outer Read allocate, Outer Write-back non-transient
 - 1111: Normal memory, Outer Read/Write allocate, Outer Write-back non-transient*/
#define DMA_CH_LINKATTR_LINKMEMATTRHI_0             (0x1UL << DMA_CH_LINKATTR_LINKMEMATTRHI_Pos)              /*!< 0x00000010UL*/
#define DMA_CH_LINKATTR_LINKMEMATTRHI_1             (0x2UL << DMA_CH_LINKATTR_LINKMEMATTRHI_Pos)              /*!< 0x00000020UL*/
#define DMA_CH_LINKATTR_LINKMEMATTRHI_2             (0x4UL << DMA_CH_LINKATTR_LINKMEMATTRHI_Pos)              /*!< 0x00000040UL*/
#define DMA_CH_LINKATTR_LINKMEMATTRHI_3             (0x8UL << DMA_CH_LINKATTR_LINKMEMATTRHI_Pos)              /*!< 0x00000080UL*/
#define DMA_CH_LINKATTR_LINKSHAREATTR_Pos           (8U)
#define DMA_CH_LINKATTR_LINKSHAREATTR_Msk           (0x3UL << DMA_CH_LINKATTR_LINKSHAREATTR_Pos)              /*!< 0x00000300UL*/
#define DMA_CH_LINKATTR_LINKSHAREATTR               DMA_CH_LINKATTR_LINKSHAREATTR_Msk                         /*!< LINKSHAREATTR[ 1:0] bits Link Address Transfer Shareability Attribute.
 - 00: Non-shareable
 - 01: Reserved
 - 10: Outer shareable
 - 11: Inner shareable */
#define DMA_CH_LINKATTR_LINKSHAREATTR_0             (0x1UL << DMA_CH_LINKATTR_LINKSHAREATTR_Pos)              /*!< 0x00000100UL*/
#define DMA_CH_LINKATTR_LINKSHAREATTR_1             (0x2UL << DMA_CH_LINKATTR_LINKSHAREATTR_Pos)              /*!< 0x00000200UL*/
/****************  Field definitions for CH_AUTOCFG register  *****************/
#define DMA_CH_AUTOCFG_CMDRESTARTCNT_Pos            (0U)
#define DMA_CH_AUTOCFG_CMDRESTARTCNT_Msk            (0xFFFFUL << DMA_CH_AUTOCFG_CMDRESTARTCNT_Pos)            /*!< 0x0000FFFFUL*/
#define DMA_CH_AUTOCFG_CMDRESTARTCNT                DMA_CH_AUTOCFG_CMDRESTARTCNT_Msk                          /*!< CMDRESTARTCNT[15:0] bits Automatic Command Restart Counter. Defines the number of times automatic restarting will occur at end of DMA command. Auto restarting will occur after the command is completed, including output triggering if enabled and autoreloading the registers, but it will only perfrom a link to the next command when CMDRESTARTCNT == 0. When CMDRESTARTCNT and CMDRESTARTINF are both set to '0', autorestart is disabled.*/
#define DMA_CH_AUTOCFG_CMDRESTARTINFEN_Pos          (16U)
#define DMA_CH_AUTOCFG_CMDRESTARTINFEN_Msk          (0x1UL << DMA_CH_AUTOCFG_CMDRESTARTINFEN_Pos)             /*!< 0x00010000UL*/
#define DMA_CH_AUTOCFG_CMDRESTARTINFEN              DMA_CH_AUTOCFG_CMDRESTARTINFEN_Msk                        /*!< CMDRESTARTINFEN bit Enable Infinite Automatic Command Restart. When set, CMDRESTARTCNT is ignored and the command is always restarted after it is completed, including output triggering if enabled and autoreloading the registers but it will not perform a link to the next command. This means that the infinite loop of automatic restarts can only be broken by DISABLECMD or STOPCMD. When CMDRESTARTINFEN is set to '0', then the autorestarting of a command depends on CMDRESTARTCNT and when that counter is set to 0 the autorestarting is finished. In this case the next linked command is read or the command is complete.*/
/****************  Field definitions for CH_LINKADDR register  ****************/
#define DMA_CH_LINKADDR_LINKADDREN_Pos              (0U)
#define DMA_CH_LINKADDR_LINKADDREN_Msk              (0x1UL << DMA_CH_LINKADDR_LINKADDREN_Pos)                 /*!< 0x00000001UL*/
#define DMA_CH_LINKADDR_LINKADDREN                  DMA_CH_LINKADDR_LINKADDREN_Msk                            /*!< LINKADDREN bit Enable Link Address. When set to '1', the DMAC fetches the next command defined by LINKADDR. When set to '0' the DMAC will return to idle at the end of the current command.
NOTE: the linked command fetched by the DMAC needs to clear this field to mark the end of the command chain. Otherwise it may result in an infinite loop of the same command.
*/
#define DMA_CH_LINKADDR_LINKADDR_Pos                (2U)
#define DMA_CH_LINKADDR_LINKADDR_Msk                (0x3FFFFFFFUL << DMA_CH_LINKADDR_LINKADDR_Pos)            /*!< 0xFFFFFFFCUL*/
#define DMA_CH_LINKADDR_LINKADDR                    DMA_CH_LINKADDR_LINKADDR_Msk                              /*!< LINKADDR[29:0] bits Link Address Pointer [31:2]. The DMAC fetches the next command from this address if LINKADDREN is set.
NOTE: Commands are fetched with the security and privilege attribute of the channel and cannot be adjusted for the command link reads.
*/
/***************  Field definitions for CH_LINKADDRHI register  ***************/
#define DMA_CH_LINKADDRHI_LINKADDRHI_Pos            (0U)
#define DMA_CH_LINKADDRHI_LINKADDRHI_Msk            (0xFFFFFFFFUL << DMA_CH_LINKADDRHI_LINKADDRHI_Pos)        /*!< 0xFFFFFFFFUL*/
#define DMA_CH_LINKADDRHI_LINKADDRHI                DMA_CH_LINKADDRHI_LINKADDRHI_Msk                          /*!< LINKADDRHI[31:0] bits Link Address Pointer [63:32]. Allows 64-bit addressing but the system might need less address bits. Limited by ADDR_WIDTH and the not implemented bits remain reserved.*/
/****************  Field definitions for CH_GPOREAD0 register  ****************/
#define DMA_CH_GPOREAD0_GPOREAD0_Pos                (0U)
#define DMA_CH_GPOREAD0_GPOREAD0_Msk                (0xFFFFFFFFUL << DMA_CH_GPOREAD0_GPOREAD0_Pos)            /*!< 0xFFFFFFFFUL*/
#define DMA_CH_GPOREAD0_GPOREAD0                    DMA_CH_GPOREAD0_GPOREAD0_Msk                              /*!< GPOREAD0[31:0] bits General Purpose Output Read Value for GPO[31:0]. Read returns the actual value of the GPO ports. Only [GPO_WIDTH-1:0] are implemented. All unimplemented bits are set to 0.*/
/***************  Field definitions for CH_WRKREGPTR register  ****************/
#define DMA_CH_WRKREGPTR_WRKREGPTR_Pos              (0U)
#define DMA_CH_WRKREGPTR_WRKREGPTR_Msk              (0xFUL << DMA_CH_WRKREGPTR_WRKREGPTR_Pos)                 /*!< 0x0000000FUL*/
#define DMA_CH_WRKREGPTR_WRKREGPTR                  DMA_CH_WRKREGPTR_WRKREGPTR_Msk                            /*!< WRKREGPTR[ 3:0] bits Internal Working Register Pointer. These pointer refers to the following:
 - 0: Reserved
 - 1: SRCADDR_INITIAL
 - 2: SRCADDRHI_INITIAL
 - 3: DESADDR_INITIAL
 - 4: DESADDRHI_INITIAL
 - 5: SRCXSIZEHI_INITIAL, SRCXSIZE_INITIAL
 - 6: DESXSIZEHI_INITIAL, DESXSIZE_INITIAL
 - 7: SRCADDR_LINEINITIAL
 - 8: SRCADDRHI_LINEINITIAL
 - 9: DESADDR_LINEINITIAL
 - 10: DESADDRHI_LINEINITIAL
 - 11: SRCYSIZE_INITIAL (HAS_2D only)
 - 12: DESYSIZE_INITIAL (HAS_2D only)
 - Others: Reserved.
NOTE: When the selected register is not supported by the DMA then it is read as 0 in the CH_WRKREGVAL register. For 1D modes the INITIAL and LINEINITIAL registers contain the same values.*/
#define DMA_CH_WRKREGPTR_WRKREGPTR_0                (0x1UL << DMA_CH_WRKREGPTR_WRKREGPTR_Pos)                 /*!< 0x00000001UL*/
#define DMA_CH_WRKREGPTR_WRKREGPTR_1                (0x2UL << DMA_CH_WRKREGPTR_WRKREGPTR_Pos)                 /*!< 0x00000002UL*/
#define DMA_CH_WRKREGPTR_WRKREGPTR_2                (0x4UL << DMA_CH_WRKREGPTR_WRKREGPTR_Pos)                 /*!< 0x00000004UL*/
#define DMA_CH_WRKREGPTR_WRKREGPTR_3                (0x8UL << DMA_CH_WRKREGPTR_WRKREGPTR_Pos)                 /*!< 0x00000008UL*/
/***************  Field definitions for CH_WRKREGVAL register  ****************/
#define DMA_CH_WRKREGVAL_WRKREGVAL_Pos              (0U)
#define DMA_CH_WRKREGVAL_WRKREGVAL_Msk              (0xFFFFFFFFUL << DMA_CH_WRKREGVAL_WRKREGVAL_Pos)          /*!< 0xFFFFFFFFUL*/
#define DMA_CH_WRKREGVAL_WRKREGVAL                  DMA_CH_WRKREGVAL_WRKREGVAL_Msk                            /*!< WRKREGVAL[31:0] bits Internal Working Register Values. WRKREGPTR points to the register that is visible here. The values are only guaranteed to be stable for the current command when STAT_PAUSED is asserted, otherwise they depend on the current status of the channel which makes them UNPREDICTABLE.*/
/****************  Field definitions for CH_ERRINFO register  *****************/
#define DMA_CH_ERRINFO_BUSERR_Pos                   (0U)
#define DMA_CH_ERRINFO_BUSERR_Msk                   (0x1UL << DMA_CH_ERRINFO_BUSERR_Pos)                      /*!< 0x00000001UL*/
#define DMA_CH_ERRINFO_BUSERR                       DMA_CH_ERRINFO_BUSERR_Msk                                 /*!< BUSERR bit Bus Error Flag. Set when the DMA encounters a bus error during data or command read transfers.*/
#define DMA_CH_ERRINFO_CFGERR_Pos                   (1U)
#define DMA_CH_ERRINFO_CFGERR_Msk                   (0x1UL << DMA_CH_ERRINFO_CFGERR_Pos)                      /*!< 0x00000002UL*/
#define DMA_CH_ERRINFO_CFGERR                       DMA_CH_ERRINFO_CFGERR_Msk                                 /*!< CFGERR bit Configuration Error Flag. Set when the DMA command is enabled or a linked command is read but it is configured in a mode that is not supported by the implementation.*/
#define DMA_CH_ERRINFO_SRCTRIGINSELERR_Pos          (2U)
#define DMA_CH_ERRINFO_SRCTRIGINSELERR_Msk          (0x1UL << DMA_CH_ERRINFO_SRCTRIGINSELERR_Pos)             /*!< 0x00000004UL*/
#define DMA_CH_ERRINFO_SRCTRIGINSELERR              DMA_CH_ERRINFO_SRCTRIGINSELERR_Msk                        /*!< SRCTRIGINSELERR bit Source Trigger Input Selection Error Flag. Set when the command selects a source trigger input that is not allowed for this channel.*/
#define DMA_CH_ERRINFO_DESTRIGINSELERR_Pos          (3U)
#define DMA_CH_ERRINFO_DESTRIGINSELERR_Msk          (0x1UL << DMA_CH_ERRINFO_DESTRIGINSELERR_Pos)             /*!< 0x00000008UL*/
#define DMA_CH_ERRINFO_DESTRIGINSELERR              DMA_CH_ERRINFO_DESTRIGINSELERR_Msk                        /*!< DESTRIGINSELERR bit Destination Trigger Input Selection Error Flag. Set when the command selects a destination trigger input that is not allowed for this channel.*/
#define DMA_CH_ERRINFO_TRIGOUTSELERR_Pos            (4U)
#define DMA_CH_ERRINFO_TRIGOUTSELERR_Msk            (0x1UL << DMA_CH_ERRINFO_TRIGOUTSELERR_Pos)               /*!< 0x00000010UL*/
#define DMA_CH_ERRINFO_TRIGOUTSELERR                DMA_CH_ERRINFO_TRIGOUTSELERR_Msk                          /*!< TRIGOUTSELERR bit Trigger Output Selection Error Flag. Set when the command selects a trigger output that is not allowed for this channel.*/
#define DMA_CH_ERRINFO_STREAMERR_Pos                (7U)
#define DMA_CH_ERRINFO_STREAMERR_Msk                (0x1UL << DMA_CH_ERRINFO_STREAMERR_Pos)                   /*!< 0x00000080UL*/
#define DMA_CH_ERRINFO_STREAMERR                    DMA_CH_ERRINFO_STREAMERR_Msk                              /*!< STREAMERR bit Stream Interface Error Flag. Set when the stream interface encountered an error.*/
#define DMA_CH_ERRINFO_ERRINFO_Pos                  (16U)
#define DMA_CH_ERRINFO_ERRINFO_Msk                  (0xFFFFUL << DMA_CH_ERRINFO_ERRINFO_Pos)                  /*!< 0xFFFF0000UL*/
#define DMA_CH_ERRINFO_ERRINFO                      DMA_CH_ERRINFO_ERRINFO_Msk                                /*!< ERRINFO[15:0] bits Error information Register. Additional information for the error that is encountered by the DMA. The meaning of the bits are detailed in the Error Handling section.*/
/******************  Field definitions for CH_IIDR register  ******************/
#define DMA_CH_IIDR_IMPLEMENTER_Pos                 (0U)
#define DMA_CH_IIDR_IMPLEMENTER_Msk                 (0xFFFUL << DMA_CH_IIDR_IMPLEMENTER_Pos)                  /*!< 0x00000FFFUL*/
#define DMA_CH_IIDR_IMPLEMENTER                     DMA_CH_IIDR_IMPLEMENTER_Msk                               /*!< IMPLEMENTER[11:0] bits Contains the JEP106 code of the company that implemented the IP:
 - [11:8]: JEP106 continuation code of implementer.
 - [7]: Always 0.
 - [6:0]: JEP106 identity code of implementer.
For Arm this field reads as 0x43B.*/
#define DMA_CH_IIDR_IMPLEMENTER_0                   (0x1UL << DMA_CH_IIDR_IMPLEMENTER_Pos)                    /*!< 0x00000001UL*/
#define DMA_CH_IIDR_IMPLEMENTER_1                   (0x2UL << DMA_CH_IIDR_IMPLEMENTER_Pos)                    /*!< 0x00000002UL*/
#define DMA_CH_IIDR_IMPLEMENTER_2                   (0x4UL << DMA_CH_IIDR_IMPLEMENTER_Pos)                    /*!< 0x00000004UL*/
#define DMA_CH_IIDR_IMPLEMENTER_3                   (0x8UL << DMA_CH_IIDR_IMPLEMENTER_Pos)                    /*!< 0x00000008UL*/
#define DMA_CH_IIDR_IMPLEMENTER_4                   (0x10UL << DMA_CH_IIDR_IMPLEMENTER_Pos)                   /*!< 0x00000010UL*/
#define DMA_CH_IIDR_IMPLEMENTER_5                   (0x20UL << DMA_CH_IIDR_IMPLEMENTER_Pos)                   /*!< 0x00000020UL*/
#define DMA_CH_IIDR_IMPLEMENTER_6                   (0x40UL << DMA_CH_IIDR_IMPLEMENTER_Pos)                   /*!< 0x00000040UL*/
#define DMA_CH_IIDR_IMPLEMENTER_7                   (0x80UL << DMA_CH_IIDR_IMPLEMENTER_Pos)                   /*!< 0x00000080UL*/
#define DMA_CH_IIDR_IMPLEMENTER_8                   (0x100UL << DMA_CH_IIDR_IMPLEMENTER_Pos)                  /*!< 0x00000100UL*/
#define DMA_CH_IIDR_IMPLEMENTER_9                   (0x200UL << DMA_CH_IIDR_IMPLEMENTER_Pos)                  /*!< 0x00000200UL*/
#define DMA_CH_IIDR_IMPLEMENTER_10                  (0x400UL << DMA_CH_IIDR_IMPLEMENTER_Pos)                  /*!< 0x00000400UL*/
#define DMA_CH_IIDR_IMPLEMENTER_11                  (0x800UL << DMA_CH_IIDR_IMPLEMENTER_Pos)                  /*!< 0x00000800UL*/
#define DMA_CH_IIDR_REVISION_Pos                    (12U)
#define DMA_CH_IIDR_REVISION_Msk                    (0xFUL << DMA_CH_IIDR_REVISION_Pos)                       /*!< 0x0000F000UL*/
#define DMA_CH_IIDR_REVISION                        DMA_CH_IIDR_REVISION_Msk                                  /*!< REVISION[ 3:0] bits Indicates the minor revision of the product rxpy identifier*/
#define DMA_CH_IIDR_REVISION_0                      (0x1UL << DMA_CH_IIDR_REVISION_Pos)                       /*!< 0x00001000UL*/
#define DMA_CH_IIDR_REVISION_1                      (0x2UL << DMA_CH_IIDR_REVISION_Pos)                       /*!< 0x00002000UL*/
#define DMA_CH_IIDR_REVISION_2                      (0x4UL << DMA_CH_IIDR_REVISION_Pos)                       /*!< 0x00004000UL*/
