wosayttn/EC_M55M1_Drive_RGB_LCD_Panel_using_EBI/SampleCode/ExampleCode/Driving_Sync_Signal_LCD_Panel_via_EBI/gdma/dma350_regdef.h
#define DMA_CH_IIDR_REVISION_3                      (0x8UL << DMA_CH_IIDR_REVISION_Pos)                       /*!< 0x00008000UL*/
#define DMA_CH_IIDR_VARIANT_Pos                     (16U)
#define DMA_CH_IIDR_VARIANT_Msk                     (0xFUL << DMA_CH_IIDR_VARIANT_Pos)                        /*!< 0x000F0000UL*/
#define DMA_CH_IIDR_VARIANT                         DMA_CH_IIDR_VARIANT_Msk                                   /*!< VARIANT[ 3:0] bits Indicates the major revision, or variant, of the product rxpy identifier*/
#define DMA_CH_IIDR_VARIANT_0                       (0x1UL << DMA_CH_IIDR_VARIANT_Pos)                        /*!< 0x00010000UL*/
#define DMA_CH_IIDR_VARIANT_1                       (0x2UL << DMA_CH_IIDR_VARIANT_Pos)                        /*!< 0x00020000UL*/
#define DMA_CH_IIDR_VARIANT_2                       (0x4UL << DMA_CH_IIDR_VARIANT_Pos)                        /*!< 0x00040000UL*/
#define DMA_CH_IIDR_VARIANT_3                       (0x8UL << DMA_CH_IIDR_VARIANT_Pos)                        /*!< 0x00080000UL*/
#define DMA_CH_IIDR_PRODUCTID_Pos                   (20U)
#define DMA_CH_IIDR_PRODUCTID_Msk                   (0xFFFUL << DMA_CH_IIDR_PRODUCTID_Pos)                    /*!< 0xFFF00000UL*/
#define DMA_CH_IIDR_PRODUCTID                       DMA_CH_IIDR_PRODUCTID_Msk                                 /*!< PRODUCTID[11:0] bits Indicates the product ID*/
#define DMA_CH_IIDR_PRODUCTID_0                     (0x1UL << DMA_CH_IIDR_PRODUCTID_Pos)                      /*!< 0x00100000UL*/
#define DMA_CH_IIDR_PRODUCTID_1                     (0x2UL << DMA_CH_IIDR_PRODUCTID_Pos)                      /*!< 0x00200000UL*/
#define DMA_CH_IIDR_PRODUCTID_2                     (0x4UL << DMA_CH_IIDR_PRODUCTID_Pos)                      /*!< 0x00400000UL*/
#define DMA_CH_IIDR_PRODUCTID_3                     (0x8UL << DMA_CH_IIDR_PRODUCTID_Pos)                      /*!< 0x00800000UL*/
#define DMA_CH_IIDR_PRODUCTID_4                     (0x10UL << DMA_CH_IIDR_PRODUCTID_Pos)                     /*!< 0x01000000UL*/
#define DMA_CH_IIDR_PRODUCTID_5                     (0x20UL << DMA_CH_IIDR_PRODUCTID_Pos)                     /*!< 0x02000000UL*/
#define DMA_CH_IIDR_PRODUCTID_6                     (0x40UL << DMA_CH_IIDR_PRODUCTID_Pos)                     /*!< 0x04000000UL*/
#define DMA_CH_IIDR_PRODUCTID_7                     (0x80UL << DMA_CH_IIDR_PRODUCTID_Pos)                     /*!< 0x08000000UL*/
#define DMA_CH_IIDR_PRODUCTID_8                     (0x100UL << DMA_CH_IIDR_PRODUCTID_Pos)                    /*!< 0x10000000UL*/
#define DMA_CH_IIDR_PRODUCTID_9                     (0x200UL << DMA_CH_IIDR_PRODUCTID_Pos)                    /*!< 0x20000000UL*/
#define DMA_CH_IIDR_PRODUCTID_10                    (0x400UL << DMA_CH_IIDR_PRODUCTID_Pos)                    /*!< 0x40000000UL*/
#define DMA_CH_IIDR_PRODUCTID_11                    (0x800UL << DMA_CH_IIDR_PRODUCTID_Pos)                    /*!< 0x80000000UL*/
/******************  Field definitions for CH_AIDR register  ******************/
#define DMA_CH_AIDR_ARCH_MINOR_REV_Pos              (0U)
#define DMA_CH_AIDR_ARCH_MINOR_REV_Msk              (0xFUL << DMA_CH_AIDR_ARCH_MINOR_REV_Pos)                 /*!< 0x0000000FUL*/
#define DMA_CH_AIDR_ARCH_MINOR_REV                  DMA_CH_AIDR_ARCH_MINOR_REV_Msk                            /*!< ARCH_MINOR_REV[ 3:0] bits Architecture Minor Revision.*/
#define DMA_CH_AIDR_ARCH_MINOR_REV_0                (0x1UL << DMA_CH_AIDR_ARCH_MINOR_REV_Pos)                 /*!< 0x00000001UL*/
#define DMA_CH_AIDR_ARCH_MINOR_REV_1                (0x2UL << DMA_CH_AIDR_ARCH_MINOR_REV_Pos)                 /*!< 0x00000002UL*/
#define DMA_CH_AIDR_ARCH_MINOR_REV_2                (0x4UL << DMA_CH_AIDR_ARCH_MINOR_REV_Pos)                 /*!< 0x00000004UL*/
#define DMA_CH_AIDR_ARCH_MINOR_REV_3                (0x8UL << DMA_CH_AIDR_ARCH_MINOR_REV_Pos)                 /*!< 0x00000008UL*/
#define DMA_CH_AIDR_ARCH_MAJOR_REV_Pos              (4U)
#define DMA_CH_AIDR_ARCH_MAJOR_REV_Msk              (0xFUL << DMA_CH_AIDR_ARCH_MAJOR_REV_Pos)                 /*!< 0x000000F0UL*/
#define DMA_CH_AIDR_ARCH_MAJOR_REV                  DMA_CH_AIDR_ARCH_MAJOR_REV_Msk                            /*!< ARCH_MAJOR_REV[ 3:0] bits Architecture Major Revision.*/
#define DMA_CH_AIDR_ARCH_MAJOR_REV_0                (0x1UL << DMA_CH_AIDR_ARCH_MAJOR_REV_Pos)                 /*!< 0x00000010UL*/
#define DMA_CH_AIDR_ARCH_MAJOR_REV_1                (0x2UL << DMA_CH_AIDR_ARCH_MAJOR_REV_Pos)                 /*!< 0x00000020UL*/
#define DMA_CH_AIDR_ARCH_MAJOR_REV_2                (0x4UL << DMA_CH_AIDR_ARCH_MAJOR_REV_Pos)                 /*!< 0x00000040UL*/
#define DMA_CH_AIDR_ARCH_MAJOR_REV_3                (0x8UL << DMA_CH_AIDR_ARCH_MAJOR_REV_Pos)                 /*!< 0x00000080UL*/
/****************  Field definitions for CH_ISSUECAP register  ****************/
#define DMA_CH_ISSUECAP_ISSUECAP_Pos                (0U)
#define DMA_CH_ISSUECAP_ISSUECAP_Msk                (0x7UL << DMA_CH_ISSUECAP_ISSUECAP_Pos)                   /*!< 0x00000007UL*/
#define DMA_CH_ISSUECAP_ISSUECAP                    DMA_CH_ISSUECAP_ISSUECAP_Msk                              /*!< ISSUECAP[ 2:0] bits ISSUECAP can be used by software to place a constraint on allowed issuing capability in both read and write direction.*/
#define DMA_CH_ISSUECAP_ISSUECAP_0                  (0x1UL << DMA_CH_ISSUECAP_ISSUECAP_Pos)                   /*!< 0x00000001UL*/
#define DMA_CH_ISSUECAP_ISSUECAP_1                  (0x2UL << DMA_CH_ISSUECAP_ISSUECAP_Pos)                   /*!< 0x00000002UL*/
#define DMA_CH_ISSUECAP_ISSUECAP_2                  (0x4UL << DMA_CH_ISSUECAP_ISSUECAP_Pos)                   /*!< 0x00000004UL*/
/***************  Field definitions for CH_BUILDCFG0 register  ****************/
#define DMA_CH_BUILDCFG0_DATA_BUFF_SIZE_Pos         (0U)
#define DMA_CH_BUILDCFG0_DATA_BUFF_SIZE_Msk         (0xFFUL << DMA_CH_BUILDCFG0_DATA_BUFF_SIZE_Pos)           /*!< 0x000000FFUL*/
#define DMA_CH_BUILDCFG0_DATA_BUFF_SIZE             DMA_CH_BUILDCFG0_DATA_BUFF_SIZE_Msk                       /*!< DATA_BUFF_SIZE[ 7:0] bits Data Buffer Size in entries - 1. Total Size = ((DATA_BUFF_SIZE + 1) * DATA_WIDTH /8) bytes.*/
#define DMA_CH_BUILDCFG0_DATA_BUFF_SIZE_0           (0x1UL << DMA_CH_BUILDCFG0_DATA_BUFF_SIZE_Pos)            /*!< 0x00000001UL*/
#define DMA_CH_BUILDCFG0_DATA_BUFF_SIZE_1           (0x2UL << DMA_CH_BUILDCFG0_DATA_BUFF_SIZE_Pos)            /*!< 0x00000002UL*/
#define DMA_CH_BUILDCFG0_DATA_BUFF_SIZE_2           (0x4UL << DMA_CH_BUILDCFG0_DATA_BUFF_SIZE_Pos)            /*!< 0x00000004UL*/
#define DMA_CH_BUILDCFG0_DATA_BUFF_SIZE_3           (0x8UL << DMA_CH_BUILDCFG0_DATA_BUFF_SIZE_Pos)            /*!< 0x00000008UL*/
#define DMA_CH_BUILDCFG0_DATA_BUFF_SIZE_4           (0x10UL << DMA_CH_BUILDCFG0_DATA_BUFF_SIZE_Pos)           /*!< 0x00000010UL*/
#define DMA_CH_BUILDCFG0_DATA_BUFF_SIZE_5           (0x20UL << DMA_CH_BUILDCFG0_DATA_BUFF_SIZE_Pos)           /*!< 0x00000020UL*/
#define DMA_CH_BUILDCFG0_DATA_BUFF_SIZE_6           (0x40UL << DMA_CH_BUILDCFG0_DATA_BUFF_SIZE_Pos)           /*!< 0x00000040UL*/
#define DMA_CH_BUILDCFG0_DATA_BUFF_SIZE_7           (0x80UL << DMA_CH_BUILDCFG0_DATA_BUFF_SIZE_Pos)           /*!< 0x00000080UL*/
#define DMA_CH_BUILDCFG0_CMD_BUFF_SIZE_Pos          (8U)
#define DMA_CH_BUILDCFG0_CMD_BUFF_SIZE_Msk          (0xFFUL << DMA_CH_BUILDCFG0_CMD_BUFF_SIZE_Pos)            /*!< 0x0000FF00UL*/
#define DMA_CH_BUILDCFG0_CMD_BUFF_SIZE              DMA_CH_BUILDCFG0_CMD_BUFF_SIZE_Msk                        /*!< CMD_BUFF_SIZE[ 7:0] bits Command Buffer Size in command words - 1. Total Size = (CMD_BUFF_SIZE + 1) * 4 bytes.*/
#define DMA_CH_BUILDCFG0_CMD_BUFF_SIZE_0            (0x1UL << DMA_CH_BUILDCFG0_CMD_BUFF_SIZE_Pos)             /*!< 0x00000100UL*/
#define DMA_CH_BUILDCFG0_CMD_BUFF_SIZE_1            (0x2UL << DMA_CH_BUILDCFG0_CMD_BUFF_SIZE_Pos)             /*!< 0x00000200UL*/
#define DMA_CH_BUILDCFG0_CMD_BUFF_SIZE_2            (0x4UL << DMA_CH_BUILDCFG0_CMD_BUFF_SIZE_Pos)             /*!< 0x00000400UL*/
#define DMA_CH_BUILDCFG0_CMD_BUFF_SIZE_3            (0x8UL << DMA_CH_BUILDCFG0_CMD_BUFF_SIZE_Pos)             /*!< 0x00000800UL*/
#define DMA_CH_BUILDCFG0_CMD_BUFF_SIZE_4            (0x10UL << DMA_CH_BUILDCFG0_CMD_BUFF_SIZE_Pos)            /*!< 0x00001000UL*/
#define DMA_CH_BUILDCFG0_CMD_BUFF_SIZE_5            (0x20UL << DMA_CH_BUILDCFG0_CMD_BUFF_SIZE_Pos)            /*!< 0x00002000UL*/
#define DMA_CH_BUILDCFG0_CMD_BUFF_SIZE_6            (0x40UL << DMA_CH_BUILDCFG0_CMD_BUFF_SIZE_Pos)            /*!< 0x00004000UL*/
#define DMA_CH_BUILDCFG0_CMD_BUFF_SIZE_7            (0x80UL << DMA_CH_BUILDCFG0_CMD_BUFF_SIZE_Pos)            /*!< 0x00008000UL*/
#define DMA_CH_BUILDCFG0_ADDR_WIDTH_Pos             (16U)
#define DMA_CH_BUILDCFG0_ADDR_WIDTH_Msk             (0x3FUL << DMA_CH_BUILDCFG0_ADDR_WIDTH_Pos)               /*!< 0x003F0000UL*/
#define DMA_CH_BUILDCFG0_ADDR_WIDTH                 DMA_CH_BUILDCFG0_ADDR_WIDTH_Msk                           /*!< ADDR_WIDTH[ 5:0] bits Address Width in bits = ADDR_WIDTH + 1*/
#define DMA_CH_BUILDCFG0_ADDR_WIDTH_0               (0x1UL << DMA_CH_BUILDCFG0_ADDR_WIDTH_Pos)                /*!< 0x00010000UL*/
#define DMA_CH_BUILDCFG0_ADDR_WIDTH_1               (0x2UL << DMA_CH_BUILDCFG0_ADDR_WIDTH_Pos)                /*!< 0x00020000UL*/
#define DMA_CH_BUILDCFG0_ADDR_WIDTH_2               (0x4UL << DMA_CH_BUILDCFG0_ADDR_WIDTH_Pos)                /*!< 0x00040000UL*/
#define DMA_CH_BUILDCFG0_ADDR_WIDTH_3               (0x8UL << DMA_CH_BUILDCFG0_ADDR_WIDTH_Pos)                /*!< 0x00080000UL*/
#define DMA_CH_BUILDCFG0_ADDR_WIDTH_4               (0x10UL << DMA_CH_BUILDCFG0_ADDR_WIDTH_Pos)               /*!< 0x00100000UL*/
#define DMA_CH_BUILDCFG0_ADDR_WIDTH_5               (0x20UL << DMA_CH_BUILDCFG0_ADDR_WIDTH_Pos)               /*!< 0x00200000UL*/
#define DMA_CH_BUILDCFG0_DATA_WIDTH_Pos             (22U)
#define DMA_CH_BUILDCFG0_DATA_WIDTH_Msk             (0x7UL << DMA_CH_BUILDCFG0_DATA_WIDTH_Pos)                /*!< 0x01C00000UL*/
#define DMA_CH_BUILDCFG0_DATA_WIDTH                 DMA_CH_BUILDCFG0_DATA_WIDTH_Msk                           /*!< DATA_WIDTH[ 2:0] bits Data Width.
 - 000: 8-bit
 - 001: 16-bit
 - 010: 32-bit
 - 011: 64-bit
 - 100: 128-bit
 - 101: 256-bit
 - 110: 512-bit
 - 111: 1024-bit*/
#define DMA_CH_BUILDCFG0_DATA_WIDTH_0               (0x1UL << DMA_CH_BUILDCFG0_DATA_WIDTH_Pos)                /*!< 0x00400000UL*/
#define DMA_CH_BUILDCFG0_DATA_WIDTH_1               (0x2UL << DMA_CH_BUILDCFG0_DATA_WIDTH_Pos)                /*!< 0x00800000UL*/
#define DMA_CH_BUILDCFG0_DATA_WIDTH_2               (0x4UL << DMA_CH_BUILDCFG0_DATA_WIDTH_Pos)                /*!< 0x01000000UL*/
#define DMA_CH_BUILDCFG0_INC_WIDTH_Pos              (26U)
#define DMA_CH_BUILDCFG0_INC_WIDTH_Msk              (0xFUL << DMA_CH_BUILDCFG0_INC_WIDTH_Pos)                 /*!< 0x3C000000UL*/
#define DMA_CH_BUILDCFG0_INC_WIDTH                  DMA_CH_BUILDCFG0_INC_WIDTH_Msk                            /*!< INC_WIDTH[ 3:0] bits Width of the increment register = INC_WIDTH + 1.
When set to 0, then only 0 and 1 can be set as an increment. When larger values are used, then negative increments can be set using 2's complement:
INC_WIDTH = 0: 0..1
INC_WIDTH = 1: -2..1
INC_WIDTH = 2: -4..3
INC_WIDTH = 3: -8..7
…
INC_WIDTH = 15: -32768..32767*/
#define DMA_CH_BUILDCFG0_INC_WIDTH_0                (0x1UL << DMA_CH_BUILDCFG0_INC_WIDTH_Pos)                 /*!< 0x04000000UL*/
#define DMA_CH_BUILDCFG0_INC_WIDTH_1                (0x2UL << DMA_CH_BUILDCFG0_INC_WIDTH_Pos)                 /*!< 0x08000000UL*/
#define DMA_CH_BUILDCFG0_INC_WIDTH_2                (0x4UL << DMA_CH_BUILDCFG0_INC_WIDTH_Pos)                 /*!< 0x10000000UL*/
#define DMA_CH_BUILDCFG0_INC_WIDTH_3                (0x8UL << DMA_CH_BUILDCFG0_INC_WIDTH_Pos)                 /*!< 0x20000000UL*/
/***************  Field definitions for CH_BUILDCFG1 register  ****************/
#define DMA_CH_BUILDCFG1_HAS_XSIZEHI_Pos            (0U)
#define DMA_CH_BUILDCFG1_HAS_XSIZEHI_Msk            (0x1UL << DMA_CH_BUILDCFG1_HAS_XSIZEHI_Pos)               /*!< 0x00000001UL*/
#define DMA_CH_BUILDCFG1_HAS_XSIZEHI                DMA_CH_BUILDCFG1_HAS_XSIZEHI_Msk                          /*!< HAS_XSIZEHI bit Has 32-bit XSIZE counters.*/
#define DMA_CH_BUILDCFG1_HAS_WRAP_Pos               (1U)
#define DMA_CH_BUILDCFG1_HAS_WRAP_Msk               (0x1UL << DMA_CH_BUILDCFG1_HAS_WRAP_Pos)                  /*!< 0x00000002UL*/
#define DMA_CH_BUILDCFG1_HAS_WRAP                   DMA_CH_BUILDCFG1_HAS_WRAP_Msk                             /*!< HAS_WRAP bit Has wrap capability.*/
#define DMA_CH_BUILDCFG1_HAS_2D_Pos                 (2U)
#define DMA_CH_BUILDCFG1_HAS_2D_Msk                 (0x1UL << DMA_CH_BUILDCFG1_HAS_2D_Pos)                    /*!< 0x00000004UL*/
#define DMA_CH_BUILDCFG1_HAS_2D                     DMA_CH_BUILDCFG1_HAS_2D_Msk                               /*!< HAS_2D bit Has 2D capability.*/
#define DMA_CH_BUILDCFG1_HAS_TMPLT_Pos              (3U)
#define DMA_CH_BUILDCFG1_HAS_TMPLT_Msk              (0x1UL << DMA_CH_BUILDCFG1_HAS_TMPLT_Pos)                 /*!< 0x00000008UL*/
#define DMA_CH_BUILDCFG1_HAS_TMPLT                  DMA_CH_BUILDCFG1_HAS_TMPLT_Msk                            /*!< HAS_TMPLT bit Has template based pack and unpack capability.*/
#define DMA_CH_BUILDCFG1_HAS_TRIG_Pos               (4U)
#define DMA_CH_BUILDCFG1_HAS_TRIG_Msk               (0x1UL << DMA_CH_BUILDCFG1_HAS_TRIG_Pos)                  /*!< 0x00000010UL*/
#define DMA_CH_BUILDCFG1_HAS_TRIG                   DMA_CH_BUILDCFG1_HAS_TRIG_Msk                             /*!< HAS_TRIG bit Has trigger capability.*/
#define DMA_CH_BUILDCFG1_HAS_TRIGIN_Pos             (5U)
#define DMA_CH_BUILDCFG1_HAS_TRIGIN_Msk             (0x1UL << DMA_CH_BUILDCFG1_HAS_TRIGIN_Pos)                /*!< 0x00000020UL*/
#define DMA_CH_BUILDCFG1_HAS_TRIGIN                 DMA_CH_BUILDCFG1_HAS_TRIGIN_Msk                           /*!< HAS_TRIGIN bit Has hardware trigger input ports.*/
#define DMA_CH_BUILDCFG1_HAS_TRIGOUT_Pos            (6U)
#define DMA_CH_BUILDCFG1_HAS_TRIGOUT_Msk            (0x1UL << DMA_CH_BUILDCFG1_HAS_TRIGOUT_Pos)               /*!< 0x00000040UL*/
#define DMA_CH_BUILDCFG1_HAS_TRIGOUT                DMA_CH_BUILDCFG1_HAS_TRIGOUT_Msk                          /*!< HAS_TRIGOUT bit Has hardware trigger output port.*/
#define DMA_CH_BUILDCFG1_HAS_TRIGSEL_Pos            (7U)
#define DMA_CH_BUILDCFG1_HAS_TRIGSEL_Msk            (0x1UL << DMA_CH_BUILDCFG1_HAS_TRIGSEL_Pos)               /*!< 0x00000080UL*/
#define DMA_CH_BUILDCFG1_HAS_TRIGSEL                DMA_CH_BUILDCFG1_HAS_TRIGSEL_Msk                          /*!< HAS_TRIGSEL bit Has selectable triggers.*/
#define DMA_CH_BUILDCFG1_HAS_CMDLINK_Pos            (8U)
#define DMA_CH_BUILDCFG1_HAS_CMDLINK_Msk            (0x1UL << DMA_CH_BUILDCFG1_HAS_CMDLINK_Pos)               /*!< 0x00000100UL*/
#define DMA_CH_BUILDCFG1_HAS_CMDLINK                DMA_CH_BUILDCFG1_HAS_CMDLINK_Msk                          /*!< HAS_CMDLINK bit Has command link list capability.*/
#define DMA_CH_BUILDCFG1_HAS_AUTO_Pos               (9U)
#define DMA_CH_BUILDCFG1_HAS_AUTO_Msk               (0x1UL << DMA_CH_BUILDCFG1_HAS_AUTO_Pos)                  /*!< 0x00000200UL*/
#define DMA_CH_BUILDCFG1_HAS_AUTO                   DMA_CH_BUILDCFG1_HAS_AUTO_Msk                             /*!< HAS_AUTO bit Has automatic reload and restart capability.*/
#define DMA_CH_BUILDCFG1_HAS_WRKREG_Pos             (10U)
#define DMA_CH_BUILDCFG1_HAS_WRKREG_Msk             (0x1UL << DMA_CH_BUILDCFG1_HAS_WRKREG_Pos)                /*!< 0x00000400UL*/
#define DMA_CH_BUILDCFG1_HAS_WRKREG                 DMA_CH_BUILDCFG1_HAS_WRKREG_Msk                           /*!< HAS_WRKREG bit Has internal register view capability.*/
#define DMA_CH_BUILDCFG1_HAS_STREAM_Pos             (11U)
#define DMA_CH_BUILDCFG1_HAS_STREAM_Msk             (0x1UL << DMA_CH_BUILDCFG1_HAS_STREAM_Pos)                /*!< 0x00000800UL*/
#define DMA_CH_BUILDCFG1_HAS_STREAM                 DMA_CH_BUILDCFG1_HAS_STREAM_Msk                           /*!< HAS_STREAM bit Has stream interface support.*/
#define DMA_CH_BUILDCFG1_HAS_STREAMSEL_Pos          (12U)
#define DMA_CH_BUILDCFG1_HAS_STREAMSEL_Msk          (0x1UL << DMA_CH_BUILDCFG1_HAS_STREAMSEL_Pos)             /*!< 0x00001000UL*/
#define DMA_CH_BUILDCFG1_HAS_STREAMSEL              DMA_CH_BUILDCFG1_HAS_STREAMSEL_Msk                        /*!< HAS_STREAMSEL bit Has selectable stream interfaces.*/
#define DMA_CH_BUILDCFG1_HAS_GPOSEL_Pos             (18U)
#define DMA_CH_BUILDCFG1_HAS_GPOSEL_Msk             (0x1UL << DMA_CH_BUILDCFG1_HAS_GPOSEL_Pos)                /*!< 0x00040000UL*/
#define DMA_CH_BUILDCFG1_HAS_GPOSEL                 DMA_CH_BUILDCFG1_HAS_GPOSEL_Msk                           /*!< HAS_GPOSEL bit Has shared GPO ports between channels.*/
#define DMA_CH_BUILDCFG1_GPO_WIDTH_Pos              (19U)
#define DMA_CH_BUILDCFG1_GPO_WIDTH_Msk              (0x7FUL << DMA_CH_BUILDCFG1_GPO_WIDTH_Pos)                /*!< 0x03F80000UL*/
#define DMA_CH_BUILDCFG1_GPO_WIDTH                  DMA_CH_BUILDCFG1_GPO_WIDTH_Msk                            /*!< GPO_WIDTH[ 6:0] bits General Purpose Output Width. 0 to 64.*/
#define DMA_CH_BUILDCFG1_GPO_WIDTH_0                (0x1UL << DMA_CH_BUILDCFG1_GPO_WIDTH_Pos)                 /*!< 0x00080000UL*/
#define DMA_CH_BUILDCFG1_GPO_WIDTH_1                (0x2UL << DMA_CH_BUILDCFG1_GPO_WIDTH_Pos)                 /*!< 0x00100000UL*/
#define DMA_CH_BUILDCFG1_GPO_WIDTH_2                (0x4UL << DMA_CH_BUILDCFG1_GPO_WIDTH_Pos)                 /*!< 0x00200000UL*/
#define DMA_CH_BUILDCFG1_GPO_WIDTH_3                (0x8UL << DMA_CH_BUILDCFG1_GPO_WIDTH_Pos)                 /*!< 0x00400000UL*/
#define DMA_CH_BUILDCFG1_GPO_WIDTH_4                (0x10UL << DMA_CH_BUILDCFG1_GPO_WIDTH_Pos)                /*!< 0x00800000UL*/
#define DMA_CH_BUILDCFG1_GPO_WIDTH_5                (0x20UL << DMA_CH_BUILDCFG1_GPO_WIDTH_Pos)                /*!< 0x01000000UL*/
#define DMA_CH_BUILDCFG1_GPO_WIDTH_6                (0x40UL << DMA_CH_BUILDCFG1_GPO_WIDTH_Pos)                /*!< 0x02000000UL*/
/******************************************************************************/
/*                                DMANSECCTRL                                 */
/******************************************************************************/
/************  Field definitions for NSEC_CHINTRSTATUS0 register  *************/
#define DMA_NSEC_CHINTRSTATUS0_CHINTRSTATUS0_Pos    (0U)
#define DMA_NSEC_CHINTRSTATUS0_CHINTRSTATUS0_Msk    (0xFFFFFFFFUL << DMA_NSEC_CHINTRSTATUS0_CHINTRSTATUS0_Pos)/*!< 0xFFFFFFFFUL*/
#define DMA_NSEC_CHINTRSTATUS0_CHINTRSTATUS0        DMA_NSEC_CHINTRSTATUS0_CHINTRSTATUS0_Msk                  /*!< CHINTRSTATUS0[31:0] bits Collated Non-Secure Channel Interrupt flags for channel 0 to channel 31. Limited by NUM_CHANNELS, all unimplemented bits are reserved.*/
/****************  Field definitions for NSEC_STATUS register  ****************/
#define DMA_NSEC_STATUS_INTR_ANYCHINTR_Pos          (0U)
#define DMA_NSEC_STATUS_INTR_ANYCHINTR_Msk          (0x1UL << DMA_NSEC_STATUS_INTR_ANYCHINTR_Pos)             /*!< 0x00000001UL*/
#define DMA_NSEC_STATUS_INTR_ANYCHINTR              DMA_NSEC_STATUS_INTR_ANYCHINTR_Msk                        /*!< INTR_ANYCHINTR bit Combined Non-Secure Channel Interrupt Flag. Set to '1' when any Non-secure channel has an interrupt request in CHINTRSTATUS0 and NSECCTRL.INTREN_ANYCHINTR = 1. Cleared automatically when the source of the channel interrupt is cleared.*/
#define DMA_NSEC_STATUS_INTR_ALLCHIDLE_Pos          (1U)
#define DMA_NSEC_STATUS_INTR_ALLCHIDLE_Msk          (0x1UL << DMA_NSEC_STATUS_INTR_ALLCHIDLE_Pos)             /*!< 0x00000002UL*/
#define DMA_NSEC_STATUS_INTR_ALLCHIDLE              DMA_NSEC_STATUS_INTR_ALLCHIDLE_Msk                        /*!< INTR_ALLCHIDLE bit All Non-Secure Channel Idle Interrupt Status. Set to '1' when NSECCTRL.STAT_ALLCHIDLE is asserted and NSECCTRL.INTREN_ALLCHIDLE = 1. Cleared automatically when STAT_ALLCHIDLE is cleared.*/
#define DMA_NSEC_STATUS_INTR_ALLCHSTOPPED_Pos       (2U)
#define DMA_NSEC_STATUS_INTR_ALLCHSTOPPED_Msk       (0x1UL << DMA_NSEC_STATUS_INTR_ALLCHSTOPPED_Pos)          /*!< 0x00000004UL*/
#define DMA_NSEC_STATUS_INTR_ALLCHSTOPPED           DMA_NSEC_STATUS_INTR_ALLCHSTOPPED_Msk                     /*!< INTR_ALLCHSTOPPED bit All Non-Secure Channel Stopped Interrupt Status. Set to '1' when NSECCTRL.STAT_ALLCHSTOPPED is asserted and NSECCTRL.INTREN_ALLCHSTOPPED = 1. Cleared automatically when STAT_ALLCHSTOPPED is cleared.*/
#define DMA_NSEC_STATUS_INTR_ALLCHPAUSED_Pos        (3U)
#define DMA_NSEC_STATUS_INTR_ALLCHPAUSED_Msk        (0x1UL << DMA_NSEC_STATUS_INTR_ALLCHPAUSED_Pos)           /*!< 0x00000008UL*/
#define DMA_NSEC_STATUS_INTR_ALLCHPAUSED            DMA_NSEC_STATUS_INTR_ALLCHPAUSED_Msk                      /*!< INTR_ALLCHPAUSED bit All Non-Secure Channel Paused Interrupt Status. Set to '1' when NSECCTRL.STAT_ALLCHPAUSED is asserted and NSECCTRL.INTREN_ALLCHPAUSED = 1. Cleared automatically when STAT_ALLCHPAUSED is cleared.*/
#define DMA_NSEC_STATUS_STAT_ALLCHIDLE_Pos          (17U)
#define DMA_NSEC_STATUS_STAT_ALLCHIDLE_Msk          (0x1UL << DMA_NSEC_STATUS_STAT_ALLCHIDLE_Pos)             /*!< 0x00020000UL*/
#define DMA_NSEC_STATUS_STAT_ALLCHIDLE              DMA_NSEC_STATUS_STAT_ALLCHIDLE_Msk                        /*!< STAT_ALLCHIDLE bit All Non-Secure Channel Idle Status. Set to '1' whenever all Non-secure DMA channel is in idle state after at least one channel was running. Cleared by writing '1' to this bit.*/
#define DMA_NSEC_STATUS_STAT_ALLCHSTOPPED_Pos       (18U)
#define DMA_NSEC_STATUS_STAT_ALLCHSTOPPED_Msk       (0x1UL << DMA_NSEC_STATUS_STAT_ALLCHSTOPPED_Pos)          /*!< 0x00040000UL*/
#define DMA_NSEC_STATUS_STAT_ALLCHSTOPPED           DMA_NSEC_STATUS_STAT_ALLCHSTOPPED_Msk                     /*!< STAT_ALLCHSTOPPED bit All Non-Secure Channel Stopped Status. Set to '1' whenever all Non-secure DMA channels are in stopped or inactive state and the ALLCHSTOP request is active. Not set when channels reach the stopped state for other reasons. All Non-secure channels are forced to an immediate stopped state until ALLCHSTOP request is asserted even if they were enabled after the request. Cleared by writing '1' to this bit. The ALLCHSTOP request is also cleared when this bit is cleared.*/
#define DMA_NSEC_STATUS_STAT_ALLCHPAUSED_Pos        (19U)
#define DMA_NSEC_STATUS_STAT_ALLCHPAUSED_Msk        (0x1UL << DMA_NSEC_STATUS_STAT_ALLCHPAUSED_Pos)           /*!< 0x00080000UL*/
#define DMA_NSEC_STATUS_STAT_ALLCHPAUSED            DMA_NSEC_STATUS_STAT_ALLCHPAUSED_Msk                      /*!< STAT_ALLCHPAUSED bit All Non-Secure Channel Paused Status. Set to '1' whenever all Non-secure DMA channel is in paused or inactive state and the ALLCHPAUSE request is active. Not set when channels reach the paused state for other reasons. All Non-secure channels are forced to an immediate pause until ALLCHPAUSE request is asserted even if they were enabled after the request. Cleared by writing '1' to this bit which results in all Non-secure channels to resume their operation. The ALLCHPAUSE request is also cleared when this bit is cleared.*/
/*****************  Field definitions for NSEC_CTRL register  *****************/
#define DMA_NSEC_CTRL_INTREN_ANYCHINTR_Pos          (0U)
#define DMA_NSEC_CTRL_INTREN_ANYCHINTR_Msk          (0x1UL << DMA_NSEC_CTRL_INTREN_ANYCHINTR_Pos)             /*!< 0x00000001UL*/
#define DMA_NSEC_CTRL_INTREN_ANYCHINTR              DMA_NSEC_CTRL_INTREN_ANYCHINTR_Msk                        /*!< INTREN_ANYCHINTR bit Combined Non-Secure Channel Interrupt Enable*/
#define DMA_NSEC_CTRL_INTREN_ALLCHIDLE_Pos          (1U)
